; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph2 - mode
	infrared1 - mode
	thermograph0 - mode
	spectrograph3 - mode
	Star3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Star20 - direction
	Star21 - direction
	Star22 - direction
	Star23 - direction
	Star24 - direction
	Star25 - direction
	Planet26 - direction
	Planet27 - direction
	Phenomenon28 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 thermograph2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star17)
	(supports instrument7 infrared1)
	(supports instrument7 thermograph2)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared1)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 spectrograph3)
	(supports instrument9 thermograph0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation0)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet13)
)
(:goal (and
	(pointing satellite3 Planet19)
	(have_image Phenomenon4 infrared1)
	(have_image Phenomenon5 thermograph0)
	(have_image Planet6 thermograph2)
	(have_image Star7 thermograph2)
	(have_image Star8 thermograph2)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 infrared1)
	(have_image Planet11 thermograph0)
	(have_image Phenomenon12 spectrograph3)
	(have_image Planet13 spectrograph3)
	(have_image Planet15 spectrograph3)
	(have_image Star16 thermograph0)
	(have_image Star17 spectrograph3)
	(have_image Phenomenon18 thermograph0)
	(have_image Planet19 infrared1)
	(have_image Star20 thermograph2)
	(have_image Star21 thermograph2)
	(have_image Star22 spectrograph3)
	(have_image Star23 thermograph0)
	(have_image Star24 spectrograph3)
	(have_image Star25 thermograph2)
	(have_image Planet26 thermograph2)
	(have_image Planet27 thermograph0)
	(have_image Phenomenon28 infrared1)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 25
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 25
3. (turn_to satellite4 groundstation2 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 groundstation2)
   goals met: 0 of 25
4. (calibrate satellite4 instrument7 groundstation2)
   added: (calibrated instrument7)
   goals met: 0 of 25
5. (turn_to satellite4 phenomenon10 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 25
6. (take_image satellite4 phenomenon10 instrument7 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 1 of 25
7. (turn_to satellite4 phenomenon12 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 25
8. (take_image satellite4 phenomenon12 instrument7 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 2 of 25
9. (turn_to satellite4 phenomenon28 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon28)
   goals met: 2 of 25
10. (take_image satellite4 phenomenon28 instrument7 infrared1)
   added: (have_image phenomenon28 infrared1)
   goals met: 3 of 25
11. (turn_to satellite4 phenomenon4 phenomenon28)
   deleted: (pointing satellite4 phenomenon28)
   added: (pointing satellite4 phenomenon4)
   goals met: 3 of 25
12. (take_image satellite4 phenomenon4 instrument7 infrared1)
   added: (have_image phenomenon4 infrared1)
   goals met: 4 of 25
13. (turn_to satellite4 planet13 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 planet13)
   goals met: 4 of 25
14. (take_image satellite4 planet13 instrument7 spectrograph3)
   added: (have_image planet13 spectrograph3)
   goals met: 5 of 25
15. (turn_to satellite4 planet15 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet15)
   goals met: 5 of 25
16. (take_image satellite4 planet15 instrument7 spectrograph3)
   added: (have_image planet15 spectrograph3)
   goals met: 6 of 25
17. (turn_to satellite4 planet19 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet19)
   goals met: 6 of 25
18. (take_image satellite4 planet19 instrument7 infrared1)
   added: (have_image planet19 infrared1)
   goals met: 7 of 25
19. (turn_to satellite4 planet26 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet26)
   goals met: 7 of 25
20. (take_image satellite4 planet26 instrument7 thermograph2)
   added: (have_image planet26 thermograph2)
   goals met: 8 of 25
21. (turn_to satellite4 planet6 planet26)
   deleted: (pointing satellite4 planet26)
   added: (pointing satellite4 planet6)
   goals met: 8 of 25
22. (take_image satellite4 planet6 instrument7 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 9 of 25
23. (turn_to satellite4 planet9 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet9)
   goals met: 9 of 25
24. (take_image satellite4 planet9 instrument7 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 10 of 25
25. (turn_to satellite4 star17 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star17)
   goals met: 10 of 25
26. (take_image satellite4 star17 instrument7 spectrograph3)
   added: (have_image star17 spectrograph3)
   goals met: 11 of 25
27. (turn_to satellite4 star20 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star20)
   goals met: 11 of 25
28. (take_image satellite4 star20 instrument7 thermograph2)
   added: (have_image star20 thermograph2)
   goals met: 12 of 25
29. (turn_to satellite4 star21 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 star21)
   goals met: 12 of 25
30. (take_image satellite4 star21 instrument7 thermograph2)
   added: (have_image star21 thermograph2)
   goals met: 13 of 25
31. (turn_to satellite4 star22 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 star22)
   goals met: 13 of 25
32. (take_image satellite4 star22 instrument7 spectrograph3)
   added: (have_image star22 spectrograph3)
   goals met: 14 of 25
33. (turn_to satellite4 star24 star22)
   deleted: (pointing satellite4 star22)
   added: (pointing satellite4 star24)
   goals met: 14 of 25
34. (take_image satellite4 star24 instrument7 spectrograph3)
   added: (have_image star24 spectrograph3)
   goals met: 15 of 25
35. (turn_to satellite4 star25 star24)
   deleted: (pointing satellite4 star24)
   added: (pointing satellite4 star25)
   goals met: 15 of 25
36. (take_image satellite4 star25 instrument7 thermograph2)
   added: (have_image star25 thermograph2)
   goals met: 16 of 25
37. (turn_to satellite4 star7 star25)
   deleted: (pointing satellite4 star25)
   added: (pointing satellite4 star7)
   goals met: 16 of 25
38. (take_image satellite4 star7 instrument7 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 17 of 25
39. (turn_to satellite4 star8 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star8)
   goals met: 17 of 25
40. (take_image satellite4 star8 instrument7 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 18 of 25
41. (turn_to satellite3 planet19 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 planet19)
   goals met: 19 of 25
42. (turn_to satellite1 groundstation1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation1)
   goals met: 19 of 25
43. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 19 of 25
44. (turn_to satellite1 phenomenon18 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon18)
   goals met: 19 of 25
45. (take_image satellite1 phenomenon18 instrument2 thermograph0)
   added: (have_image phenomenon18 thermograph0)
   goals met: 20 of 25
46. (turn_to satellite1 phenomenon5 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon5)
   goals met: 20 of 25
47. (take_image satellite1 phenomenon5 instrument2 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 21 of 25
48. (turn_to satellite1 planet11 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet11)
   goals met: 21 of 25
49. (take_image satellite1 planet11 instrument2 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 22 of 25
50. (turn_to satellite1 planet27 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet27)
   goals met: 22 of 25
51. (take_image satellite1 planet27 instrument2 thermograph0)
   added: (have_image planet27 thermograph0)
   goals met: 23 of 25
52. (turn_to satellite1 star16 planet27)
   deleted: (pointing satellite1 planet27)
   added: (pointing satellite1 star16)
   goals met: 23 of 25
53. (take_image satellite1 star16 instrument2 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 24 of 25
54. (turn_to satellite1 star23 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star23)
   goals met: 24 of 25
55. (take_image satellite1 star23 instrument2 thermograph0)
   added: (have_image star23 thermograph0)
   goals met: 25 of 25
